# Series和数据框常用统计函数

In [1]:
import numpy as np
import pandas as pd

In [4]:
# sum(),min(),std()函数的使用

In [11]:
pan1 = pd.DataFrame(np.random.randint(10,50,(5,5)))
pan1

    0   1   2   3   4
0  13  10  40  18  13
1  47  38  48  34  37
2  42  11  34  47  34
3  25  35  11  41  17
4  43  16  11  12  23

In [14]:
# 产生nan值
rand = np.random.randint(0,6,1)
pan1.loc[rand,rand] = np.nan
pan1

      0     1   2   3   4
0   NaN  10.0  40  18  13
1  47.0   NaN  48  34  37
2  42.0  11.0  34  47  34
3  25.0  35.0  11  41  17
4  43.0  16.0  11  12  23

In [15]:
# 列相加
pan1.sum(axis=0)

0    157.0
1     72.0
2    144.0
3    152.0
4    124.0
dtype: float64

In [19]:
# 列相加，将不跳过nan值
# nan值与任何值相加都为nan
pan1.sum(axis=0,skipna=False)

0      NaN
1      NaN
2    144.0
3    152.0
4    124.0
dtype: float64

In [23]:
# 求列的平均值
pan1.mean(axis=0,skipna=False)

0     NaN
1     NaN
2    28.8
3    30.4
4    24.8
dtype: float64

In [25]:
# 按照列计算标准差
pan1.std(0)

0     9.742518
1    11.633286
2    16.991174
3    14.943226
4    10.449880
dtype: float64

In [27]:
# 按照行计算标准差
pan1.std(1)

0    13.573872
1     7.047458
2    13.794927
3    12.377399
4    13.171940
dtype: float64

In [32]:
pan2 = pd.DataFrame(np.random.randint(10,50,(5,5)),index=list("abcde"),columns=["v"+str(i) for i in range(5)])
pan2

   v0  v1  v2  v3  v4
a  40  30  43  23  18
b  23  14  48  41  18
c  20  18  32  19  45
d  46  48  28  36  23
e  28  15  25  48  41

In [36]:
# idxmax() 求出每列的最大值并返回索引
# 改变轴，将返回行索引的最大值
pan2.idxmax()

v0    d
v1    d
v2    b
v3    e
v4    c
dtype: object

In [37]:
# idxmin() 求出最小值的下标
pan2.idxmin()

v0    c
v1    b
v2    e
v3    c
v4    a
dtype: object

In [38]:
# 累加函数cumsum()
pan2.cumsum()

    v0   v1   v2   v3   v4
a   40   30   43   23   18
b   63   44   91   64   36
c   83   62  123   83   81
d  129  110  151  119  104
e  157  125  176  167  145

In [39]:
# 累乘函数cumprod()函数
pan2.cumprod()

         v0       v1        v2        v3        v4
a        40       30        43        23        18
b       920      420      2064       943       324
c     18400     7560     66048     17917     14580
d    846400   362880   1849344    645012    335340
e  23699200  5443200  46233600  30960576  13748940

In [42]:
# describe()函数
# 使用字典的形式创建数据框
dict1 = {"Name":list("ABCD"),"Age":[12,13,16,19],"price":[1,3,8,6]}
pan3 = pd.DataFrame(dict1)
pan3

  Name  Age  price
0    A   12      1
1    B   13      3
2    C   16      8
3    D   19      6

In [44]:
# describe()函数，无参数的时候，只统计数字型的字段
# 数量，平均值，标准差，最小值........
pan3.describe()

             Age     price
count   4.000000  4.000000
mean   15.000000  4.500000
std     3.162278  3.109126
min    12.000000  1.000000
25%    12.750000  2.500000
50%    14.500000  4.500000
75%    16.750000  6.500000
max    19.000000  8.000000

In [46]:
# 将字符串进行统计
pan3.describe(include="all")

       Name        Age     price
count     4   4.000000  4.000000
unique    4        NaN       NaN
top       D        NaN       NaN
freq      1        NaN       NaN
mean    NaN  15.000000  4.500000
std     NaN   3.162278  3.109126
min     NaN  12.000000  1.000000
25%     NaN  12.750000  2.500000
50%     NaN  14.500000  4.500000
75%     NaN  16.750000  6.500000
max     NaN  19.000000  8.000000

In [47]:
# 只看字符串的统计结果
pan3.describe(include=[np.object])

       Name
count     4
unique    4
top       D
freq      1

##### 去重

In [52]:
ser4 = pd.Series(np.random.randint(4,9,5),index=list("abcde"))
ser4

a    6
b    5
c    6
d    6
e    5
dtype: int32

In [53]:
# 判断是否重复
ser4.duplicated()

a    False
b    False
c     True
d     True
e     True
dtype: bool

In [57]:
# 删除Series的重复项
ser4.drop_duplicates()

a    6
b    5
dtype: int32

In [71]:
# unique() 去重

ser4.unique()

array([6, 5], dtype=int64)

In [73]:
# 对Series的频数统计
# 适用于数组，元组，列表，Series
ser5 = pd.Series(np.random.randint(11,15,10))
ser5.value_counts()

11    5
13    3
14    1
12    1
dtype: int64

In [69]:
pan3 = pd.DataFrame(np.random.randint(10,11,(5,5)),index=list("abcde"),columns=["v"+str(i) for i in range(5)])
pan3

   v0  v1  v2  v3  v4
a  10  10  10  10  10
b  10  10  10  10  10
c  10  10  10  10  10
d  10  10  10  10  10
e  10  10  10  10  10

In [70]:
# 删除重复项
pan3.drop_duplicates()

   v0  v1  v2  v3  v4
a  10  10  10  10  10

In [80]:
# 使用.loc（），value_counts()对数据框进行频数统计
pan3["v0"].value_counts()

10    5
Name: v0, dtype: int64